In [7]:
import pandas as pd
import datetime as dt
from prophet import Prophet

In [52]:
#read in the csv files
df_household_income = pd.read_csv("./Resources/median_household_income.csv").drop("LocationType", axis=1)
df_foster_care = pd.read_csv("./Resources/children_in_foster_care.csv").drop("LocationType", axis=1)
df_dropouts = pd.read_csv("./Resources/dropouts.csv").drop("LocationType", axis=1)

In [53]:
#change column Location to "State"
df_household_income.rename(columns={'Location': 'State'}, inplace = True)
df_foster_care.rename(columns={'Location': 'State'}, inplace = True)
df_dropouts.rename(columns={'Location': 'State'}, inplace = True)

#change column TimeFrame to "Year"
df_household_income.rename(columns={'TimeFrame': 'Year'}, inplace = True)
df_foster_care.rename(columns={'TimeFrame': 'Year'}, inplace = True)
df_dropouts.rename(columns={'TimeFrame': 'Year'}, inplace = True)

In [54]:
#Drop "Children in Immigrant Families" and "DataFormat" columns from df_household_income
df_household_income = df_household_income.drop(["Children in Immigrant Families", "DataFormat"], axis = 1)

#Drop "DataFormat" column from df_foster_care
df_foster_care = df_foster_care.drop( "DataFormat", axis = 1)

#Drop "DataFormat" column from df_dropouts
df_dropouts = df_dropouts.drop( "DataFormat", axis = 1)

In [55]:
#drop all rows with "United States" value in the "State" column
df_household_income = df_household_income[df_household_income['State'] != 'United States']
df_foster_care = df_foster_care[df_foster_care['State'] != 'United States']
df_dropouts = df_dropouts[df_dropouts['State'] != 'United States']

In [56]:
#set index to "State"
df_household_income = df_household_income.set_index("State")
df_foster_care = df_foster_care.set_index("State")
df_dropouts = df_dropouts.set_index("State")

In [57]:
#display first and last 5 rows of df_household_income
df_household_income

             Year   Data
State
Alabama      2021  63400
Alabama      2021  67300
Alabama      2019  55400
Alabama      2019  61700
Alabama      2017  44600
...           ...    ...
Puerto Rico  2014  18000
Puerto Rico  2016  22100
Puerto Rico  2016  19500
Puerto Rico  2021  30400
Puerto Rico  2021  22500

[1976 rows x 2 columns]

In [58]:
#display first and last 5 rows of df_foster_care
df_foster_care

            Year    Data
State
Alabama     2000    5611
Alaska      2000    2192
Arizona     2000    6470
Arkansas    2000    3043
California  2000  112664
...          ...     ...
California  2021   44356
Arkansas    2021    4515
Arizona     2021   13679
Alaska      2021    2820
Alabama     2021    5294

[2264 rows x 2 columns]

In [59]:
#display first and last 5 rows of df_dropouts
df_dropouts

            Year    Data
State
Alabama     2000   31000
Alaska      2000    3000
Arizona     2000   49000
Arkansas    2000   17000
California  2000  180000
...          ...     ...
Arkansas    2021    5000
California  2021   58000
Arizona     2021   24000
Alaska      2021    2000
Alabama     2021   13000

[2288 rows x 2 columns]

In [60]:
#display info about df_household_income
df_dropouts.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2288 entries, Alabama to Alabama
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Year    2288 non-null   int64
 1   Data    2288 non-null   object
dtypes: int64(1), object(1)
memory usage: 53.6+ KB

In [62]:
#display info about df_foster_care
df_foster_care.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2264 entries, Alabama to Alabama
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Year    2264 non-null   int64
 1   Data    2264 non-null   int64
dtypes: int64(2)
memory usage: 53.1+ KB

In [63]:
#display info about df_dropouts
df_dropouts.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2288 entries, Alabama to Alabama
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Year    2288 non-null   int64
 1   Data    2288 non-null   object
dtypes: int64(1), object(1)
memory usage: 53.6+ KB